"""
Задание 1. Написать программу, которая будет складывать, вычитать,
умножать или делить два числа. Числа и знак операции вводятся пользователем.
После выполнения вычисления программа не должна завершаться, а должна
запрашивать новые данные для вычислений. Завершение программы должно
выполняться при вводе символа '0' в качестве знака операции. Если пользователь
вводит неверный знак (не '0', '+', '-', '*', '/'), то программа должна
сообщать ему об ошибке и снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
"""


def calculator():
    num1 = float(input('x='))
    num2 = float(input('y='))
    s = input("Знак (+,-,*,/): ")
    if s == '0':
        return
    if s in ('+', '-', '*', '/'):
        if s == '+':
            print(f'= {num1 + num2}\n')
        elif s == '-':
            print(f'= {num1 - num2}\n')
        elif s == '*':
            print(f'= {num1 * num2}\n')
        elif s == '/':
            if num2 != 0:
                print(f'= {num1 / num2}\n')
            else:
                print("Деление на ноль!")
    else:
        print("Неверный знак операции!")
    return calculator()


calculator()



